#### Week 2 - Data Analysis with Pandas

# Lesson 6: Filtering Dataframes

Project Challenges: Analyzing Names

Using the baby_names_all_years.csv dataset created in Methods, Functions, and Attributes solve the following tasks with pandas:

In [1]:
import pandas as pd

In [4]:
# 1. Read in data:
df = pd.read_csv('baby_names_all_years.csv')

In [5]:
df

              name gender  frequency  year
0             Mary      F       7065  1880
1             Anna      F       2604  1880
2             Emma      F       2003  1880
3        Elizabeth      F       1939  1880
4           Minnie      F       1746  1880
...            ...    ...        ...   ...
2052776     Zyeire      M          5  2021
2052777       Zyel      M          5  2021
2052778      Zyian      M          5  2021
2052779      Zylar      M          5  2021
2052780        Zyn      M          5  2021

[2052781 rows x 4 columns]

In [6]:
# 2. Create a boolean mask for the name 'Martin'. It should just be a Series of True and False values.

boolean_mask = df["name"] == "Martin"
boolean_mask

0          False
1          False
2          False
3          False
4          False
           ...
2052776    False
2052777    False
2052778    False
2052779    False
2052780    False
Name: name, Length: 2052781, dtype: bool

In [7]:
# 3. Use this boolean mask to filter your original DataFrame and display a DataFrame which only has babies names 'Martin'. 

martin = df.loc[df["name"] == "Martin"]
martin

           name gender  frequency  year
986      Martin      M        357  1880
2983     Martin      M        327  1881
5009     Martin      M        387  1882
7160     Martin      M        377  1883
9365     Martin      M        385  1884
...         ...    ...        ...   ...
1911563  Martin      M       1282  2017
1943908  Martin      M       1295  2018
1975970  Martin      M       1248  2019
2007530  Martin      M       1163  2020
2039089  Martin      M       1089  2021

[242 rows x 4 columns]

In [8]:
# 4. How many entries are the in the 'Martin' DataFrame? How many years are in the DataFrame? Why are there more entries of the name 'Martin' than years? In how many years does the name 'Martin' appear for both genders?

martin.count()

name         242
gender       242
frequency    242
year         242
dtype: int64

In [10]:
# 5. Filter the combined DataFrame for a DataFrame which only has names that have a frequency over 2000

frequency_over_2000 = df.loc[df["frequency"] > 2000]
frequency_over_2000.sort_values(by=["frequency"], ascending = False)

            name gender  frequency  year
431064     Linda      F      99693  1947
441435     Linda      F      96212  1948
437168     James      M      94762  1947
544671   Michael      M      92723  1957
437169    Robert      M      91651  1947
...          ...    ...        ...   ...
1350848   Peyton      M       2001  2000
994596      Drew      M       2001  1986
1793558   Emilia      F       2001  2014
62536      Irene      F       2001  1903
604375     Lance      M       2001  1962

[32445 rows x 4 columns]

In [13]:
# 6. Filter the combined DataFrame for a DataFrame which only has names that have a frequency 
#over 2000 and for years starting with 2000. 

year_frequency_over_2000 = df.loc[boolean_mask]

In [14]:
year_frequency_over_2000

            name gender  frequency  year
1333008    Emily      F      25957  2000
1333009   Hannah      F      23085  2000
1333010  Madison      F      19968  2000
1333011   Ashley      F      17997  2000
1333012    Sarah      F      17708  2000
...          ...    ...        ...   ...
2038969    Kevin      M       2094  2021
2038970    Judah      M       2093  2021
2038971     Finn      M       2082  2021
2038972     King      M       2028  2021
2038973    Brody      M       2025  2021

[7703 rows x 4 columns]

In [15]:
#What is the most common name since 2000?

year_frequency_over_2000.sort_values(by=["frequency"], ascending=False)

            name gender  frequency  year
1350666    Jacob      M      34489  2000
1380760    Jacob      M      32560  2001
1350667  Michael      M      32040  2000
1411148    Jacob      M      30580  2002
1380761  Michael      M      29687  2001
...          ...    ...        ...   ...
1911479  Lorenzo      M       2003  2017
1643965    Erick      M       2003  2009
1454992  Delaney      F       2002  2004
1793558   Emilia      F       2001  2014
1350848   Peyton      M       2001  2000

[7703 rows x 4 columns]

In [39]:
# 7. Filter the combined DataFrame for a DataFrame which only has names that have a 
#frequency over 2000, for years starting with 2000 and for only females. 

boolean_mask = (df["frequency"] > 2000) & (df["year"] >= 2000) & (df["gender"] == "F")
boolean_mask

0          False
1          False
2          False
3          False
4          False
           ...
2052776    False
2052777    False
2052778    False
2052779    False
2052780    False
Length: 2052781, dtype: bool

In [34]:
females_2000 = df.loc[boolean_mask]
females_2000

            name gender  frequency  year
1333008    Emily      F      25957  2000
1333009   Hannah      F      23085  2000
1333010  Madison      F      19968  2000
1333011   Ashley      F      17997  2000
1333012    Sarah      F      17708  2000
...          ...    ...        ...   ...
2021375  Cecilia      F       2085  2021
2021376     Mary      F       2080  2021
2021377    Daisy      F       2062  2021
2021378    Alina      F       2017  2021
2021379    Lucia      F       2006  2021

[3460 rows x 4 columns]

In [44]:
only_females_2000["gender"].unique()

array(['F'], dtype=object)

In [46]:
only_females_2000.nunique()

name          303
gender          1
frequency    2587
year           22
dtype: int64

In [29]:
#What is the most common name given to females since 2000?

In [47]:
female_name = only_females_2000["frequency"].max()
female_name

25957

In [31]:
females_2000.loc[females_2000["frequency"] == f_name]

          name gender  frequency  year
1350666  Jacob      M      34489  2000

In [49]:
only_females_2000.loc[only_females_2000["frequency"] == female_name]

          name gender  frequency  year
1333008  Emily      F      25957  2000

In [50]:
# 8. What is the percentage of names that have a frequency larger than 100?

boolean_mask = df["frequency"] > 100

In [52]:
frequency_100 = df.loc[boolean_mask]
frequency_100

              name gender  frequency  year
0             Mary      F       7065  1880
1             Anna      F       2604  1880
2             Emma      F       2003  1880
3        Elizabeth      F       1939  1880
4           Minnie      F       1746  1880
...            ...    ...        ...   ...
2040426      Mahir      M        101  2021
2040427       Nael      M        101  2021
2040428       Noam      M        101  2021
2040429      Syrus      M        101  2021
2040430     Tyrell      M        101  2021

[244408 rows x 4 columns]

In [53]:
frequency_100["frequency"].max()

99693

In [56]:
frequency_100["frequency"].min()

101

In [57]:
len(frequency_higher_100)

244408

In [58]:
percentage_of_100 = (len(frequency_higher_100)/len(df))
percentage_of_100

0.11906189700703582